Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_semc.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name SEMC Initialization and De-initialization
 * @{
 */

/****************************************************************************
 * Function: imxrt_semc_getdefaultconfig
 *
 * Description:
 *   brief Gets the SEMC default basic configuration structure.
 * 
 *   The purpose of this API is to get the default SEMC
 *   configure structure for imxrt_semc_init(). User may use the initialized
 *   structure unchanged in imxrt_semc_init(), or modify some fields of the
 *   structure before calling imxrt_semc_init().
 *   Example:
     @code
     semc_config_t config;
     imxrt_semc_getdefaultconfig(&config);
     @endcode
 *
 * Input Parameters:
 *   config The SEMC configuration structure pointer.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_semc_getdefaultconfig(semc_config_t *config);

/****************************************************************************
 * Function: imxrt_semc_init
 *
 * Description:
 *   brief Initializes SEMC.
 * 
 *   This function ungates the SEMC clock and initializes SEMC.
 *   This function must be called before calling any other SEMC driver functions.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   configure The SEMC configuration structure pointer.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_semc_init(SEMC_Type *base, semc_config_t *configure);

/****************************************************************************
 * Function: imxrt_semc_deinit
 *
 * Description:
 *   brief Deinitializes the SEMC module and gates the clock.
 * 
 *   This function gates the SEMC clock. As a result, the SEMC module doesn't work after
 *   calling this function, for some IDE, calling this API may cause the next downloading
 *   operation failed. so, please call this API cautiously. Additional, users can
 *   using "#define FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL (1)" to disable the clock control
 *   operation in drivers.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void imxrt_semc_deinit(SEMC_Type *base);

/* @} */

/*!
 * @name SEMC Configuration Operation For Each Memory Type
 * @{
 */

/****************************************************************************
 * Function: imxrt_semc_configuresdram
 *
 * Description:
 *   brief Configures SDRAM controller in SEMC.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   cs The chip selection.
 *   config The sdram configuration.
 *   clkSrc_Hz The SEMC clock frequency.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
status_t imxrt_semc_configuresdram(SEMC_Type *base, semc_sdram_cs_t cs, semc_sdram_config_t *config, uint32_t clkSrc_Hz);

/****************************************************************************
 * Function: imxrt_semc_configurenand
 *
 * Description:
 *   Configures NAND controller in SEMC.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   config The nand configuration.
 *   clkSrc_Hz The SEMC clock frequency.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
status_t imxrt_semc_configurenand(SEMC_Type *base, semc_nand_config_t *config, uint32_t clkSrc_Hz);

/****************************************************************************
 * Function: imxrt_semc_configurenor
 *
 * Description:
 *   Configures NOR controller in SEMC.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   config The nor configuration.
 *   clkSrc_Hz The SEMC clock frequency.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
status_t imxrt_semc_configurenor(SEMC_Type *base, semc_nor_config_t *config, uint32_t clkSrc_Hz);

/****************************************************************************
 * Function: imxrt_semc_configuresram
 *
 * Description:
 *   Configures SRAM controller in SEMC.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   config The sram configuration.
 *   clkSrc_Hz The SEMC clock frequency.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
status_t imxrt_semc_configuresram(SEMC_Type *base, semc_sram_config_t *config, uint32_t clkSrc_Hz);

/****************************************************************************
 * Function: imxrt_semc_configuredbi
 *
 * Description:
 *   Configures DBI controller in SEMC.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   config The dbi configuration.
 *   clkSrc_Hz The SEMC clock frequency.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
status_t imxrt_semc_configuredbi(SEMC_Type *base, semc_dbi_config_t *config, uint32_t clkSrc_Hz);

/* @} */

/*!
 * @name SEMC Interrupt Operation
 * @{
 */

/****************************************************************************
 * Function: imxrt_semc_enableinterrupts
 *
 * Description:
 *   brief Enables the SEMC interrupt.
 *
 *   This function enables the SEMC interrupts according to the provided mask. The mask
 *   is a logical OR of enumeration members. See @ref semc_interrupt_enable_t.
 *   For example, to enable the IP command done and error interrupt, do the following.
 *   @code
 *     SEMC_EnableInterrupts(ENET, kSEMC_IPCmdDoneInterrupt | kSEMC_IPCmdErrInterrupt);
 *   @endcode
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   mask  SEMC interrupts to enable. This is a logical OR of the
 *         enumeration :: semc_interrupt_enable_t.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
static inline void imxrt_semc_enableinterrupts(SEMC_Type *base, uint32_t mask)
{
    base->INTEN |= mask;
}

/****************************************************************************
 * Function: imxrt_semc_disableinterrupts
 *
 * Description:
 *   brief Disables the SEMC interrupt.
 *
 *   This function disables the SEMC interrupts according to the provided mask. The mask
 *   is a logical OR of enumeration members. See @ref semc_interrupt_enable_t.
 *   For example, to disable the IP command done and error interrupt, do the following.
 *   @code
 *     SEMC_DisableInterrupts(ENET, kSEMC_IPCmdDoneInterrupt | kSEMC_IPCmdErrInterrupt);
 *   @endcode
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   mask  SEMC interrupts to disable. This is a logical OR of the
 *         enumeration :: semc_interrupt_enable_t.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
static inline void imxrt_semc_disableinterrupts(SEMC_Type *base, uint32_t mask)
{
    base->INTEN &= ~mask;
}

/****************************************************************************
 * Function: imxrt_semc_getstatusflag
 *
 * Description:
 *   brief Gets the SEMC status.
 *
 *   This function gets the SEMC interrupts event status.
 *   User can use the a logical OR of enumeration member as a mask.
 *   See @ref semc_interrupt_enable_t.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *
 * Returned Value:
 *   Returns status flag, use status flag in semc_interrupt_enable_t to get the related status.
 *
 ****************************************************************************/
static inline bool imxrt_semc_getstatusflag(SEMC_Type *base)
{
    return base->INTR;
}

/****************************************************************************
 * Function: imxrt_semc_clearstatusflags
 *
 * Description:
 *   brief Clears the SEMC status flag state.
 *
 *   This function gets the SEMC interrupts event status.
 *   User can use the a logical OR of enumeration member as a mask.
 *   See @ref semc_interrupt_enable_t.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *
 * Returned Value:
 *   Returns status flag, use status flag in semc_interrupt_enable_t to get the related status.
 *
 ****************************************************************************/
static inline void imxrt_semc_clearstatusflags(SEMC_Type *base, uint32_t mask)
{
    base->INTR |= mask;
}

/* @} */

/*!
 * @name SEMC Memory Access Operation
 * @{
 */

/****************************************************************************
 * Function: imxrt_semc_isinidle
 *
 * Description:
 *   brief Check if SEMC is in idle.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *
 * Returned Value:
 *   Returns True SEMC is in idle, false is not in idle.
 *
 ****************************************************************************/
static inline bool imxrt_semc_isinidle(SEMC_Type *base)
{
    return (base->STS0 & SEMC_STS0_IDLE_MASK) ? true : false;
}

/****************************************************************************
 * Function: imxrt_semc_sendipcommand
 *
 * Description:
 *   brief SEMC IP command access.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   type  SEMC memory type. refer to "semc_mem_type_t"
 *   address  SEMC device address.
 *   command  SEMC IP command.
 *     For NAND device, we should use the SEMC_BuildNandIPCommand to get the right nand command.
 *     For NOR/DBI device, take refer to "semc_ipcmd_nor_dbi_t".
 *     For SRAM device, take refer to "semc_ipcmd_sram_t".
 *     For SDRAM device, take refer to "semc_ipcmd_sdram_t".
 *   write  Data for write access.
 *   read   Data pointer for read data out.
 *
 * Returned Value:
 *   Returns status
 *
 ****************************************************************************/
status_t imxrt_semc_sendipcommand(
    SEMC_Type *base, semc_mem_type_t type, uint32_t address, uint16_t command, uint32_t write, uint32_t *read);

/****************************************************************************
 * Function: imxrt_semc_buildnandipcommand
 *
 * Description:
 *   brief Build SEMC IP command for NAND.
 *
 *   This function build SEMC NAND IP command. The command is build of user command code,
 *   SEMC address mode and SEMC command mode.
 *
 * Input Parameters:
 *   userCommand  NAND device normal command.
 *   addrMode  NAND address mode. Refer to "semc_ipcmd_nand_addrmode_t".
 *   cmdMode   NAND command mode. Refer to "semc_ipcmd_nand_cmdmode_t".
 *
 * Returned Value:
 *   Returns status
 *
 ****************************************************************************/
static inline uint16_t imxrt_semc_buildnandipcommand(uint8_t userCommand,
                                               semc_ipcmd_nand_addrmode_t addrMode,
                                               semc_ipcmd_nand_cmdmode_t cmdMode)
{
    return (uint16_t)((uint16_t)userCommand << 8) | (uint16_t)(addrMode << 4) | ((uint8_t)cmdMode & 0x0Fu);
}

/****************************************************************************
 * Function: imxrt_semc_isnandready
 *
 * Description:
 *   brief Check if the NAND device is ready.
 *
 * Input Parameters:
 *   base  SEMC peripheral base address.
 *
 * Returned Value:
 *   Returns True NAND is ready, false NAND is not ready.
 *
 ****************************************************************************/
static inline bool imxrt_semc_isnandready(SEMC_Type *base)
{
    return (base->STS0 & SEMC_STS0_NARDY_MASK) ? true : false;
}

/****************************************************************************
 * Function: imxrt_semc_ipcommandnandwrite
 *
 * Description:
 *   brief SEMC NAND device memory write through IP command.
 *
 * Input Parameters:
 *   base  SEMC peripheral base address.
 *   address  SEMC NAND device address.
 *   data  Data for write access.
 *   size_bytes   Data length.
 *
 * Returned Value:
 *   Returns status.
 *
 ****************************************************************************/
status_t imxrt_semc_ipcommandnandwrite(SEMC_Type *base, uint32_t address, uint8_t *data, uint32_t size_bytes);

/****************************************************************************
 * Function: imxrt_semc_ipcommandnandread
 *
 * Description:
 *   brief SEMC NAND device memory read through IP command.
 *
 * Input Parameters:
 *   base  SEMC peripheral base address.
 *   address  SEMC NAND device address.
 *   data  Data pointer for data read out.
 *   size_bytes   Data length.
 *
 * Returned Value:
 *   Returns status.
 *
 ****************************************************************************/
status_t imxrt_semc_ipcommandnandread(SEMC_Type *base, uint32_t address, uint8_t *data, uint32_t size_bytes);

/****************************************************************************
 * Function: imxrt_semc_ipcommandnorwrite
 *
 * Description:
 *   brief SEMC NOR device memory write through IP command.
 *
 * Input Parameters:
 *   base  SEMC peripheral base address.
 *   address  SEMC NOR device address.
 *   data  Data for write access.
 *   size_bytes   Data length.
 *
 * Returned Value:
 *   Returns status.
 *
 ****************************************************************************/
status_t imxrt_semc_ipcommandnorwrite(SEMC_Type *base, uint32_t address, uint8_t *data, uint32_t size_bytes);

/****************************************************************************
 * Function: imxrt_semc_ipcommandnorread
 *
 * Description:
 *   brief SEMC NOR device memory read through IP command.
 *
 * Input Parameters:
 *   base  SEMC peripheral base address.
 *   address  SEMC NOR device address.
 *   data  Data pointer for data read out.
 *   size_bytes   Data length.
 *
 * Returned Value:
 *   Returns status.
 *
 ****************************************************************************/
status_t imxrt_semc_ipcommandnorread(SEMC_Type *base, uint32_t address, uint8_t *data, uint32_t size_bytes);

/* @} */

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* _FSL_SEMC_H_*/
